v2206/solver_ADMFoam/ADTank_RAS/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// nu              1e-4;
nu              2e-4;

// Thermal expansion coefficient
beta            3e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              0.7;

// Turbulent Prandtl number
Prt             0.85;

// ************************************************************************* //
