v2206/solver_ADMFoam/ADTank_RAS/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // default         steadyState;
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{

    // default         Gauss linear;
    // div(phi,U)      bounded Gauss linearUpwind unlimited;
    // div(phi,T)      bounded Gauss linearUpwind unlimited;

    // turbulence      bounded Gauss linearUpwind limited;
    // div(phi,k)      $turbulence;
    // div(phi,omega)  $turbulence;
    // div(phi,epsilon) $turbulence;
    // div((nuEff*dev2(T(grad(U))))) Gauss linear;

    default         none;

    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,T)      bounded Gauss linearUpwind unlimited;

    turbulence      Gauss upwind;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    // default         corrected;
    default         limited corrected 0.33;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
