v2206/solver_ADMFoam/ADTank_RAS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        smoother        DICGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    // p_rgh
    // {
    //     solver          PCG;
    //     preconditioner  DIC;
    //     tolerance       1e-6;
    //     relTol          0.01;
    // }

    // p_rghFinal
    // {
    //     $p_rgh;
    //     relTol          0;
    // }

    // "(U|T|k|omega|epsilon)"
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-8;
    //     relTol          0.01;
    // }

    // "(U|T|k|omega|epsilon)Final"
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-8;
    //     relTol          0.01;
    // }

    "T"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "TFinal"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 2;
    nCorrectors      1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

// SIMPLE
// {
//     nNonOrthogonalCorrectors 2;
//     consistent      yes;
//     pRefCell		0;
//     pRefValue		0;
//     residualControl
//     {
//         U                   1e-4;
//         p                   1e-4;
//         "(k|epsilon|omega)" 1e-4;
//     }
// }

relaxationFactors
{
    equations
    {
        U                   0.95;
        "(k|omega|epsilon)" 0.95;
    }
}

// ************************************************************************* //
